<?php
session_start();
include_once 'dbconnect.php';
?>

<?php

require_once('connection.php');

?>

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
    <meta name="description" content="" />
    <meta name="author" content="" />
    <title>Pet Match</title>
    <!-- Favicon-->
    <link rel="icon" type="image/x-icon" href="images/icons/favicon.png" />
    <!-- Font Awesome icons (free version)-->
    <script src="https://use.fontawesome.com/releases/v5.15.4/js/all.js" crossorigin="anonymous"></script>
    <!-- Google fonts-->
    <link href="https://fonts.googleapis.com/css?family=Montserrat:400,700" rel="stylesheet" type="text/css" />
    <link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,100,300,700" rel="stylesheet" type="text/css" />
    <!-- Core theme CSS (includes Bootstrap)-->
    <link href="css/index.css" rel="stylesheet" />
    <!-- research css -->
    <link rel="stylesheet" href="css/form.css">
    <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
</head>

<body id="page-top">
    <!-- Navigation-->
    <nav class="navbar navbar-expand-lg navbar-dark fixed-top" id="mainNav">
        <div class="container">
            <a class="navbar-brand" href="index.php">Pet Match</a>
            <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarResponsive" aria-controls="navbarResponsive" aria-expanded="false" aria-label="Toggle navigation">
                Menu
                <i class="fas fa-bars ms-1"></i>
            </button>
            <div class="collapse navbar-collapse" id="navbarResponsive">
                <ul class="navbar-nav text-uppercase ms-auto py-4 py-lg-0">
                    <!--6.if already logged in, change menu items -->
                    <?php if (isset($_SESSION['id'])) { ?>
                        <li>
                            <p style="color:#FFD700">Signed in as <?php echo $_SESSION['name']; ?></p>
                        </li>
                        &nbsp; &nbsp; &nbsp;
                        <li><a style="color:#FFFFFF" href="form.php">แบบฟอร์มข้อมูลสัตว์เลี้ยง</a></li>
                        &nbsp; &nbsp; &nbsp;
                        <li><a style="color:#FFFFFF" href="logout.php">Log Out</a></li>
                    <?php } else { ?>
                        <li><a class="nav-link" href="login.php">Login</a></li>
                        <li><a class="nav-link" href="singup.php">Sign Up</a></li>
                    <?php } ?>
                </ul>
            </div>
        </div>
    </nav>
    <!-- Masthead-->
    <header class="masthead">
        <div class="container">
            <!-- <div class="masthead-subheading">หาคู่ให้สัตว์เลี้ยงแสนรักษ์ของคุณ</div> -->
            <div class="masthead-heading text-uppercase" style="color: #ffc800">
                <h1 mb-3>หาคู่ให้สัตว์เลี้ยงแสนรักของคุณ</h1>
            </div>
            <!--div class="a-container">
                <form id="booking-form" class="booking-form" method="POST">
                    <div class="form-group">
                        <div class="form-destination">
                            <label for="destination">ประเภทสัตว์</label>
                            <input type="email" class="form-control" id="email"> 
                            <select id="ประเภท" name="ประเภท" class="form-control form-control-lg">
                                <option placeholder="ปรเภท">โปรดเลือก</option>
                                <option value="สุนัข">สุนัข</option>
                                <option value="แมว">แมว</option>
                            </select>
                        </div>
                        <div class="form-date-from form-icon">
                            <label for="date_from">อายุ</label><br>
                            <input type="number" id="age" placeholder="อายุของสัตว์">
                        </div>
                        <div class="form-date-from form-icon">
                            <label for="date_from">เพศ</label>
                            <select id="เพศ" name="เพศ" class="form-control form-control-lg">
                                <option placeholder="เพศ">โปรดเลือก</option>
                                <option value="ผู้">ตัวผู้</option>
                                <option value="เมีย">ตัวเมีย</option>
                            </select>
                        </div>
                        <div class="form-submit">
                            <input type="submit" id="submit" class="submit" value="ค้นหา" />
                        </div>
                    </div>
                </form>
            </div> -->
        </div>
    </header>
    <!-- Services-->
    <section class="page-section" id="services">
        <div class="container">
            <div class="text-center">
                <h2 class="section-heading text-uppercase" style="color:#000000">Pet Watch</h2>
                <h3 class="section-subheading text-muted">จับคู่สัตว์เลี้ยงของคุณ</h3>
            </div>
            <div class="row">
                <!-- Post-->
                <?php
                // $search=isset($_GET['age']) ? $_GET['age']:'';
                $select_stmt = $db->prepare('SELECT * FROM tbl_file ');
                $select_stmt->execute();

                while ($row = $select_stmt->fetch(PDO::FETCH_ASSOC)) {
                ?>
                    <div class="col-lg-4 mt-4">
                        <form action="" method="POST">
                            <div div class="card">
                                <p><img src="upload/<?php echo $row['image']; ?>" width="350px" height="350px" alt=""></p>
                                <div class="card-body">
                                    <p>ประเภทสัตว์ : <?php echo $row['types']; ?></p>
                                    <p>เพศสัตว์ : <?php echo $row['sex']; ?></p>
                                    <p>พันธุ์สัตว์ : <?php echo $row['breed']; ?></p>
                                    <p>ชื่อสัตว์ : <?php echo $row['name']; ?></p>
                                    <p>เบอร์โทรติดต่อ : <?php echo $row['tel']; ?></p>
                                    <p>อายุสัตว์ : <?php echo $row['age']; ?></p>
                                </div>
                            </div>
                        </form>
                    </div>
                <?php } ?>
            </div>
        </div>

    </section>
    <!-- Portfolio Grid-->
    <section class="page-section bg-light" id="portfolio" >
        <div class="container">
            <div class="text-center">
                <h2 class="section-heading text-uppercase" style="color:#000000">ความรู้เบื้องต้น</h2>
                <h3 class="section-subheading text-muted">แนะนำความรู้เบื้องต้นในการดูแลและสังเกตุสัตว์เลี้ยง</h3>
            </div>
            <div class="row">
                <div class="col-lg-4 col-sm-6 mb-4">
                    <!-- Portfolio item 1-->
                    <div class="portfolio-item">
                        <a class="portfolio-link" data-bs-toggle="modal" href="#portfolioModal1">
                            <div class="portfolio-hover">
                                <div class="portfolio-hover-content"><i class="fas fa-plus fa-3x"></i></div>
                            </div>
                            <img class="img-fluid" src="assets/img/portfolio/1.jpg" alt="..." />
                        </a>
                        <div class="portfolio-caption">
                            <div class="portfolio-caption-heading">วิธีดูแลสุนัขเบื้องต้น</div>
                            <div class="portfolio-caption-subheading text-muted">ข้อมูลและวิธีการดูแลสุนัขของคุณในขั้นเบื้องต้น</div>
                        </div>
                    </div>
                </div>
                <div class="col-lg-4 col-sm-6 mb-4">
                    <!-- Portfolio item 2-->
                    <div class="portfolio-item">
                        <a class="portfolio-link" data-bs-toggle="modal" href="#portfolioModal2">
                            <div class="portfolio-hover">
                                <div class="portfolio-hover-content"><i class="fas fa-plus fa-3x"></i></div>
                            </div>
                            <img class="img-fluid" src="assets/img/portfolio/2.jpg" alt="..." />
                        </a>
                        <div class="portfolio-caption">
                            <div class="portfolio-caption-heading">วิธีดูแลแมวเบื้องต้น</div>
                            <div class="portfolio-caption-subheading text-muted">ข้อมูลและวิธีการดูแลแมวของคุณในขั้นเบื้องต้น</div>
                        </div>
                    </div>
                </div>
                <div class="col-lg-4 col-sm-6 mb-4">
                    <!-- Portfolio item 3-->
                    <div class="portfolio-item">
                        <a class="portfolio-link" data-bs-toggle="modal" href="#portfolioModal3">
                            <div class="portfolio-hover">
                                <div class="portfolio-hover-content"><i class="fas fa-plus fa-3x"></i></div>
                            </div>
                            <img class="img-fluid" src="assets/img/portfolio/3.jpg" alt="..." />
                        </a>
                        <div class="portfolio-caption">
                            <div class="portfolio-caption-heading">วิธีสังเกตุพฤกติกรรมสุนัข</div>
                            <div class="portfolio-caption-subheading text-muted">ข้อมูลที่จะช่วยให้คุณสังเกตุพฤกติกรรมของสุนัขของคุณได้ง่ายขึ้น</div>
                        </div>
                    </div>
                </div>
                <div class="col-lg-4 col-sm-6 mb-4 mb-lg-0">
                    <!-- Portfolio item 4-->
                    <div class="portfolio-item">
                        <a class="portfolio-link" data-bs-toggle="modal" href="#portfolioModal4">
                            <div class="portfolio-hover">
                                <div class="portfolio-hover-content"><i class="fas fa-plus fa-3x"></i></div>
                            </div>
                            <img class="img-fluid" src="assets/img/portfolio/4.jpg" alt="..." />
                        </a>
                        <div class="portfolio-caption">
                            <div class="portfolio-caption-heading">วิธีสังเกตุพฤกติกรรมแมว</div>
                            <div class="portfolio-caption-subheading text-muted">ข้อมูลที่จะช่วยให้คุณสังเกตุพฤกติกรรมของแมวของคุณได้ง่ายขึ้น</div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <!-- Team-->
    <section class="page-section bg-light" id="team">
        <div class="container">
            <div class="text-center">
                <h2 class="section-heading text-uppercase" style="color:#000000">Team</h2>
                <br>
            </div>
            <div class="row">
                <div class="col-lg-4">
                    <div class="team-member">
                        <img class="mx-auto rounded-circle" src="assets/img/team/chainn.jpg" alt="..." />
                        <h4 style="color:#000000">NoRaPoN BoOnTaMcHuAy</h4>
                        <h5 class="section-subheading text-muted" style="color:#000000">6210513033</h5>
                        <a class="btn btn-dark btn-social mx-2" href="https://www.facebook.com/Norapon.Bc"><i class="fab fa-facebook-f"></i></a>
                    </div>
                </div>
                <div class="col-lg-4">
                    <div class="team-member">
                        <img class="mx-auto rounded-circle" src="assets/img/team/kren.jpg" alt="..." />
                        <h4 style="color:#000000">Wisitsak Tansui</h4>
                        <h5 class="section-subheading text-muted" style="color:#000000">6210513057</h5>
                        <a class="btn btn-dark btn-social mx-2" href="https://www.facebook.com/profile.php?id=100002637256774"><i class="fab fa-facebook-f"></i></a>
                    </div>
                </div>
                <div class="col-lg-4">
                    <div class="team-member">
                        <img class="mx-auto rounded-circle" src="assets/img/team/nai.jpg" alt="..." />
                        <h4 style="color:#000000">Supphakorn Siriyot</h4>
                        <h5 class="section-subheading text-muted" style="color:#000000">6210513061</h5>
                        <a class="btn btn-dark btn-social mx-2" href="https://www.facebook.com/nai.supphakorn.1"><i class="fab fa-facebook-f"></i></a>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <!-- Footer-->
    <footer class="footer py-4">
        <div class="container">
            <div class="row align-items-center">
                <div class="col-lg-4 text-lg-start" style="color:#000000">477-302 WEB PROGRAMING </div>
            </div>
        </div>
    </footer>
    <!-- Portfolio Modals-->
    <!-- Portfolio item 1 modal popup-->
    <div class="portfolio-modal modal fade" id="portfolioModal1" tabindex="-1" role="dialog" aria-hidden="true">
        <div class="modal-dialog">
            <div class="modal-content">
                <div class="close-modal" data-bs-dismiss="modal"><img src="assets/img/close-icon.svg" alt="Close modal" /></div>
                <div class="container">
                    <div class="row justify-content-center">
                        <div class="col-lg-8">
                            <div class="modal-body">
                                <!-- Project details-->
                                <h2 class="text-uppercase">วิธีดูแลสุนัขเบื้องต้น</h2>
                                <p class="item-intro text-muted"></p>
                                <img class="img-fluid d-block mx-auto" src="assets/img/portfolio/1.jpg" alt="..." />
                                <p>สุนัข เป็นสัตว์เลี้ยงที่มีความน่ารักฝึกง่าย ทำให้เป็นสัตว์เลี้ยงที่ได้รับความนิยมอยู่ในลำดับต้นๆ แต่สุนัขก็เป็นสัตว์เลี้ยงที่สร้างปัญหาให้กับคนเลี้ยงได้มากมาย หากขาดการดูแลที่ถูกต้องหรือไม่เข้าใจการเลี้ยงดูสุนัขตามลักษณะนิสัยของแต่ละสายพันธุ์ วันนี้ เรามี 10 ข้อ พื้นฐานในการดูแลสุนัข มาแนะนำเป็นความรู้ครับ</p>
                                <b>
                                    <p align=left> 10 ข้อ พื้นฐานในการดูแลสุนัข </p>
                                </b>
                                <b>
                                    <p align=left>1. ฝึกใช้ปลอกคอและโซ่ล่าม <br>
                                </b>
                                คนเลี้ยงสุนัขต้องทำความเข้าใจว่า สัตว์เลี้ยงของเราไม่ได้น่ารักหรือเป็นที่ชื่นชอบของทุกคนเสมอไป การปล่อยสุนัขโดยไม่ฝึกการใช้ปลอกคอหรือใช้โซ่ล่ามในบางโอกาส อาจทำให้สุนัขก่อความรำคาญ และรบกวนเพื่อนบ้าน จนทำให้เกิดความขัดแย้งได้</p>
                                <b>
                                    <p align=left>2. มีความพร้อมในการเลี้ยงดู <br>
                                </b>
                                แม้สุนัขจะเป็นสัตว์เลี้ยงที่ดูแลง่าย และเลี้ยงไม่ยาก แต่การเลี้ยงดูสุนัข ผู้เลี้ยงก็ต้องมีความพร้อม ไม่ปล่อยให้สุนัขอดอยากหรือหากินเอง ควรเลี้ยงในจำนวนที่พอเหมาะไม่ปล่อยให้วิ่งเล่นเห่าเสียงดังรบกวนเพื่อนบ้าน</p>
                                <b>
                                    <p align=left>3. เลือกสายพันธุ์ที่เหมาะกับสภาพการเลี้ยงดู <br>
                                </b>
                                การเลี้ยงสุนัขมีทั้งเลี้ยงไว้เป็นเพื่อนเล่น เลี้ยงด้วยความรักความเอ็นดู และเลี้ยงไว้เพื่อเฝ้าหรือดูแลทรัพย์สิน สุนัขแต่ละสายพันธุ์มีลักษณะนิสัยและมีคุณสมบัติตอบโจทย์ความต้องการของผู้เลี้ยงแตกต่างกัน ก่อนเลี้ยงควรศึกษาลักษณะนิสัยให้เหมาะกับจุดประสงค์ในการเลี้ยงเป็นสำคัญ</p>
                                <b>
                                    <p align=left>4. ศึกษาลักษณะนิสัยของสุนัขแต่ละสายพันธุ์ <br>
                                </b>
                                การเลี้ยงสุนัขให้มีอายุยืนยาว คนเลี้ยงต้องรู้ลักษณะนิสัยและพฤติกรรมของสุนัขที่เราเลี้ยงไว้ด้วย เพื่อดูแลและป้องกันอันตรายหรือความเสียหายที่อาจเกิดจากการเลี้ยงสุนัข เช่น สุนัขกัดทำร้าย หรือสร้างปัญหาให้เพื่อนบ้าน</p>
                                <b>
                                    <p align=left>5. ดูแลสุขภาพของสุนัข <br>
                                </b>
                                การเลี้ยงสุนัขโรคภัยที่น่ากลัว ก็คือ โรคพิษสุนัขบ้า และยังเป็นโรคที่รักษาไม่หายเมื่อนำสุนัขมาเลี้ยงต้องฉีดวัคซีนป้องโรค และพาไปพบสัตว์แพทย์เพื่อดูแลรักษาสุขภาพบ้าง</p>
                                <b>
                                    <p align=left>6. ดูแลเรื่องความสะอาด <br>
                                </b>
                                สุนัขเป็นสัตว์เลี้ยงที่ฝีกสอนได้ง่าย ฟังคำสั่งคนเลี้ยงและสามารถทำตามได้ การฝึกระเบียบวินัยในการขับถ่ายต้องฝึกตั้งแต่สุนัขยังเล็กๆ ดูแลเรื่องความสะอาดอาบน้ำและกำจัดเห็บหมัดให้สุนัขอย่างสม่ำเสมอ เพราะนอกจากเป็นปัญหาสุขภาพของสุนัขแล้ว ยังเป็นปัญหาสุขภาพของคนเลี้ยงอีกด้วย</p>
                                <b>
                                    <p align=left>7. ดูแลเรื่องอาหารสุนัข <br>
                                </b>
                                สุนัขเป็นสัตว์เลี้ยงที่กินง่ายอยู่ง่าย โดยเฉพาะการเลี้ยงระบบเปิด แต่การเลี้ยงสุนัขให้มีสุขภาพดี ต้องฝึกสุนัขกินอาหารเม็ดหรืออาหารสำเร็จรูปบ้าง เพราะมีสารอาหารที่ครบถ้วน ทำให้สุนัขมีสุขภาพที่แข็งแรงและมีภูมิต้านทาโรคที่ดี</p>
                                <b>
                                    <p align=left>8. เลี้ยงดูอย่างใกล้ชิด <br>
                                </b>
                                การเลี้ยงดูอย่างใกล้ชิด โดยเล่นหรือหยอกล้อทำให้สุนัขคุ้นเคยและผูกพันกับคนเลี้ยง นอกจากนั้นการดูแลอย่างใกล้ชิด ยังทำให้เห็นพฤติกรรมและความเปลี่ยนแปลงของสุนัข เช่น ก้าวร้าว หรือเจ็บป่วย</p>
                                <b>
                                    <p align=left>9. ทำหมันให้สุนัข <br>
                                </b>
                                สุนัขแต่ละตัวมีอายุไขตั้งแต่ 10-13 ปี มากหรือน้อยกว่านี้ขึ้นอยู่กับสายพันธุ์และการเลี้ยงดูของคนเลี้ยง หากไม่พร้อมที่จะเลี้ยงสุนัขพร้อมกันหลายๆตัว ควรทำหมันให้กับสุนัข สำหรับสุนัขเพศผู้ช่วงเป็นสัตว์หรือต้องการผสมพันธุ์อาจมีนิสัยก้าวร้าวชอบเที่ยว การทำหมันช่วยลดพฤติกรรมเหล่านี้</p>
                                <b>
                                    <p align=left>10. พาสุนัขไปเดินเที่ยวหรือออกกำลังกาย <br>
                                </b>
                                สุนัขบางสายพันธุ์มีกล้ามเนื้อที่แข็งแรง เพราะชอบวิ่งชอบออกกำลังกาย สำหรับการเลี้ยงอยู่ในพื้นที่จำกัด ควรพาสุนัขออกไปเดินเล่นบ้างเพื่อผ่อนคลายไม่ทำให้สุนัขเครียดและยังทำให้สุนัขได้ออกกำลังกายด้วย</p>
                                <b>
                                    <p>10 ข้อพื้นฐานในการดูแลสุนัขทำได้ไม่ยากครับ เพราะเชื่อว่าคนที่เลี้ยงย่อมมีความรักความชื่นชอบสัตว์เลี้ยงประเภทนี้เป็นต้นทุนอยู่แล้ว</p>
                                </b>
                                <button class="btn btn-warning btn-xl text-uppercase" data-bs-dismiss="modal" type="button">
                                    <i class="fas fa-times me-1"></i>
                                    Close Project
                                </button>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- Portfolio item 2 modal popup-->
    <div class="portfolio-modal modal fade" id="portfolioModal2" tabindex="-1" role="dialog" aria-hidden="true">
        <div class="modal-dialog">
            <div class="modal-content">
                <div class="close-modal" data-bs-dismiss="modal"><img src="assets/img/close-icon.svg" alt="Close modal" /></div>
                <div class="container">
                    <div class="row justify-content-center">
                        <div class="col-lg-8">
                            <div class="modal-body">
                                <!-- Project details-->
                                <h2 class="text-uppercase">วิธีดูแลแมวเบื้องต้น</h2>
                                <p class="item-intro text-muted"></p>
                                <img class="img-fluid d-block mx-auto" src="assets/img/portfolio/2.jpg" alt="..." />
                                <p> วิธีเลี้ยงแมวในบ้านให้มีความสุข 9 วิธีที่เรานำมาฝากกันในวันนี้ จะทำอย่างไรให้เจ้าเหมียวของเราแฮปปี้ได้บ้าง ตามไปดูกันเลย</p>
                                <p align=left>การเลี้ยงแมวในคอนโด ห้องพัก หรือในบ้านมักจะมีข้อจำกัดหลาย ๆ อย่าง แตกต่างจากการเลี้ยงแบบปล่อย เพราะมีพื้นที่กว้าง ๆ ให้ได้วิ่งเล่นและเจอสภาพแวดล้อมที่หลากหลายกว่า ดังนั้นแล้ววิธีเลี้ยงเจ้าเหมียวในบ้านจึงค่อนข้างที่จะต้องเอาใจใส่มากขึ้นไม่อย่างนั้นอาจทำให้แมวเหมียวอารมณ์ดีกลายเป็นเหมียวขี้เหงาได้ และสำหรับวิธีเลี้ยงแมวในบ้านให้มีความสุข วันนี้กระปุกดอทคอมได้รวบรวมมาฝากกันแล้วค่ะ</p>
                                <b>
                                    <p align=left> 1. มีมุมให้นั่งกินลมชมวิว </p>
                                </b>
                                <p align=left> สำหรับที่นั่งชมวิวของเจ้าเหมียวตามเมืองนอกมักจะนิยมทำ screened porch หรือระเบียงเล็ก ๆ ที่คล้ายกับเรือนกระจกหน้าบ้านเอาไว้ให้เจ้าเหมียวนั่งกินลมชมวิว มองนกในสนามหญ้าหน้าบ้าน ซึ่งจะทำให้เจ้าเหมียวปลอดภัยกว่าการออกไปนั่งเล่นนอกบ้าน หากทาสแมวคนไหนที่มีงบน้อย สามารถทำที่ชมวิวแบบง่าย ๆ ได้ด้วยการติดชั้นวางของติดผนังตามขอบหน้าต่างแล้วหาเบาะนุ่ม ๆ มาวาง แค่นี้ก็จะได้มุมชมวิวให้เจ้าเหมียวแล้ว</p>
                                <b>
                                    <p align=left> 2. วางคอนโดแมวให้เจ้าเหมียวลับเล็บ</p>
                                </b>
                                <p align=left> อีกปัญหาหนึ่งที่ทาสแมวต้องเจอก็คือ รอยขีดข่วนตามเฟอร์นิเจอร์อันมาจากคมเล็บของเจ้าแมว ไม่ใช่ว่าพวกมันนิสัยเสีย ชอบทำลายข้าวของอะไรหรอกนะ แต่นั่นเป็นธรรมชาติของเจ้าเหมียวที่ต้องลับเล็บตลอดเวลา ดังนั้นแล้วทาสแมวควรหาที่ลับเล็บมาไว้ให้เจ้าเหมียวด้วย ซึ่งคอนโดแมวก็ตอบโจทย์เป็นอย่างดี เจ้าเหมียวจะได้ทั้งปีนป่ายเล่นและลับเล็บไปพร้อม ๆ กัน สามารถซื้อหาได้ตามร้านเพ็ทช็อปหรือจะ DIY เองก็ไม่ยาก</p>
                                <b>
                                    <p align=left> 3. มีของเล่นหลากหลาย</p>
                                </b>
                                <p align=left> แมวที่เลี้ยงแบบปล่อยจะมีพัฒนาการด้านต่าง ๆ ที่ค่อนข้างเร็วกว่าแมวที่เลี้ยงในบ้าน เนื่องจากได้ออกไปสำรวจและทำกิจกรรมต่าง ๆ อย่างอิสระ สำหรับเจ้าเหมียวที่อยู่ในบ้านนั้นจะมีข้อกำจัดในเรื่องนี้ แต่ทั้งนี้เจ้าของสามารถกระตุ้นประสาทสัมผัสต่าง ๆ ของเจ้าเหมียวได้ด้วยของเล่น โดยให้เลือกของเล่นที่หลากหลาย ไม่ว่าจะเป็นไม้ล่อแมว ตุ๊กตาหนู หรืออาจจะเป็นของที่หาได้ง่าย ๆ อย่างเช่น ถุง หรือ กล่อง เป็นต้น</p>
                                <b>
                                    <p align=left> 4. ปลูกหญ้าแมวให้เจ้าเหมียวเคี้ยวเล่น </p>
                                </b>
                                <p align=left> ทาสแมวหลายคนคงจะคุ้นเคยและรู้กันดีว่า เจ้าเหมียวจะชอบดมและเคี้ยวต้นหญ้าหรือต้นไม้เล็ก ๆ เล่นเพื่อรักษาสุขภาพของตัวเอง สำหรับบ้านหรือคอนโดที่ไม่มีสนามหญ้าให้เจ้าเหมียวได้ออกไปเคี้ยวเล่น ให้ปลูกหญ้าแมวใส่กระถางเล็กตั้งไว้ในบ้านแทน ซึ่งต้นไม้ที่แมวชอบกิน ได้แก่ ต้นไผ่เงิน ต้นข้าวสาลีอ่อน เป็นต้น</p>
                                <b>
                                    <p align=left> 5.เปิดทีวีให้ดู</p>
                                </b>
                                <p align=left> แมวเป็นสัตว์ที่สนใจและตื่นตัวกับสิ่งที่เคลื่อนไหวได้ อย่างใบไม้และนกบนต้นไม้ข้างหน้าต่างพวกเจ้าเหมียวอาจนั่งมองได้นานสองนาน แต่สำหรับตามหน้าต่างคอนโดสูงอาจจะไม่มีนกไม่มีใบไม้ให้แมวได้นั่งมอง ซึ่งภาพเคลื่อนไหวในทีวีก็ทำให้พวกเจ้าเหมียวนั่งดูเพลิน ๆ ได้เหมือนกัน</p>
                                <b>
                                    <p align=left> 6. มีเวลาเล่นด้วย</p>
                                </b>
                                <p align=left> เนื่องจากแมวเป็นสัตว์สังคมและชอบเล่น เจ้าของก็ควรมีเวลามาเล่นกับเจ้าเหมียวทุกวัน ไม่ใช่ปล่อยให้เจ้าเหมียวเล่นกับของเล่นแค่อย่างเดียว ของเล่นแมวมีเท่าไรก็ขนออกมาเล่นกับเจ้าเหมียวให้หมดค่ะ ยิ่งหลากหลายเจ้าเหมียวยิ่งชอบ จะได้เล่นของเล่นหลายแบบและไม่เบื่อด้วย</p>
                                <b>
                                    <p align=left> 7. พาออกไปเปิดหูเปิดตา</p>
                                </b>
                                <p align=left> การเลี้ยงแมวในบ้านไม่ใช่ปล่อยเจ้าเหมียวไว้ในบ้านอย่างเดียว แต่ควรพาเจ้าเหมียวไปเปิดหูเปิดตาบ้าง สำหรับผู้ที่อาศัยอยู่ในย่านที่สุนัขไม่เพ่นพ่าน ก็สามารถจูงเจ้าเหมียวไปเดินเล่นตามสวนสาธารณะได้ โดยก่อนจะพาเจ้าเหมียวออกไปเดินเล่นนอกบ้านควรจะฝึกให้คุ้นเคยกับการใส่สายจูงคล้องคอตอนเดินซะก่อน หรือถ้าแถวบ้านใครเจ้าถิ่นคุม เจ้าตูบในซอยบ้านเยอะ อาจจะพาเจ้าเหมียวไปขับรถเล่นแทนก็ได้</p>
                                <b>
                                    <p align=left> 8. ทำความสะอาดสม่ำเสมอ</p>
                                </b>
                                <p align=left> ไม่มีใครรู้ซึ้งถึงกลิ่นมูลแมวได้เท่ากับทาสแมวอีกแล้ว ทรายแมวที่ช่วยดับกลิ่นบางครั้งยังเอาไม่อยู่ สำหรับแมวที่เลี้ยงแบบเปิดอาจจะไม่หนักใจกับเรื่องนี้เท่าไร เนื่องจากเจ้าเหมียวจะออกไปขับถ่ายนอกบ้านอยู่แล้ว วิธีการลดกลิ่นสำหรับแมวที่เลี้ยงในบ้าน สามารถทำได้ด้วยการตักสิ่งขับถ่ายออก เติมและหรือเปลี่ยนทรายแมว หมั่นทำความสะอาดกระบะที่เจ้าเหมียวใช้เป็นประจำ รวมถึงการเลือกอาหารที่ช่วยลดกลิ่นมูลแมวก็เป็นอีกวิธีที่ช่วยได้เช่นกัน</p>
                                <b>
                                    <p align=left> 9. อาหาร </p>
                                </b>
                                <p align=left> การเลือกอาหารให้เจ้าเหมียวเป็นสิ่งสำคัญ เพราะแมวเป็นสัตว์กินเนื้อ (carnivore) อาหารที่เหมาะสมจึงควรมีสัดส่วนของโปรตีนที่สูงและมีสารอาหารที่ครบคุณค่าตรงตามความต้องการของแมวแต่ละช่วงวัย โดยอาหารที่เลือกจะต้องมีโปรตีนที่ดีมีคุณภาพ อย่างเช่น อาหารแมวสำเร็จรูปที่มีวัตถุดิบหลักจากไก่ ซึ่งเป็นโปรตีนคุณภาพดี และข้าวแหล่งคาร์โบไฮเดรตที่ย่อยง่าย และร่างกายเจ้าเหมียวสามารถดูดซึมนำสารอาหารไปใช้ประโยชน์ได้ดี
                                    นอกจากนี้ต้องเลือกให้เหมาะสมกับอายุและ lifestyle ของเจ้าเหมียวด้วย อย่างเช่น ถ้าเป็นแมวที่เลี้ยงในบ้าน ก็ควรเลือกอาหารสูตรที่เหมาะกับแมวที่เลี้ยงในบ้านโดยเฉพาะ อย่างอาหารแมว มีโอ® โกลด์ แมวเลี้ยงในบ้าน อาหารที่มีส่วนผสมของสารสกัดยัคคาที่ช่วยลดกลิ่นมูลของเจ้าเหมียว ลดกลิ่นปาก เพื่อสุขภาพเหงือกและฟันที่ดีด้วยโซเดียม เฮกซะเมทตาฟอสเฟทและเส้นใยเซลลูโลส เพราะเจ้าเหมียวต้องอยู่ใกล้ชิดกับเรา สุขอนามัยและสภาพแวดล้อมจึงเป็นเรื่องสำคัญ</p>
                                <p align=left> อีกทั้งยังมีสูตรอื่น ๆ ให้เลือกตามความต้องการที่หลากหลาย อาหารแมว มีโอ® โกลด์ แมวเปอร์เซีย พัฒนาสูตรเฉพาะสำหรับแมวเปอร์เซียและแมวขนยาวทุกสายพันธุ์ มีคุณสมบัติสำคัญคือ ช่วยป้องกันก้อนขนอุดตันด้วยเยื่อใยธรรมชาติ บำรุงสุขภาพผิวหนังและขนสวยด้วยโอเมก้า 3 และ 6, Organic Zinc และ Biotin และอาหารแมว มีโอ® โกลด์ ฟิตแอนด์เฟิร์ม ที่ดูแลให้เจ้าเหมียวของคุณสุขภาพดีสมวัย มีรูปร่างที่เหมาะสมด้วยแอล-คาร์นิทีน
                                    รู้แบบนี้แล้วก็อย่าลืมเลือกสิ่งดี ๆ ให้กับเจ้าเหมียวที่บ้านนะคะ โดยเฉพาะ อาหารแมว เรื่องสำคัญที่ต้องใส่ใจเป็นพิเศษเลย </p>
                                <button class="btn btn-warning btn-xl text-uppercase" data-bs-dismiss="modal" type="button">
                                    <i class="fas fa-times me-1"></i>
                                    Close Project
                                </button>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- Portfolio item 3 modal popup-->
    <div class="portfolio-modal modal fade" id="portfolioModal3" tabindex="-1" role="dialog" aria-hidden="true">
        <div class="modal-dialog">
            <div class="modal-content">
                <div class="close-modal" data-bs-dismiss="modal"><img src="assets/img/close-icon.svg" alt="Close modal" /></div>
                <div class="container">
                    <div class="row justify-content-center">
                        <div class="col-lg-8">
                            <div class="modal-body">
                                <!-- Project details-->
                                <h2 class="text-uppercase">วิธีสังเกตุพฤกติกรรมสุนัข</h2>
                                <p class="item-intro text-muted"></p>
                                <img class="img-fluid d-block mx-auto" src="assets/img/portfolio/3.jpg" alt="..." />
                                <b>
                                    <p> ทำไมเราต้องรู้พฤติกรรมของสุนัข </p>
                                </b>
                                <p align=left> แม้สุนัขจะไม่สามารถสื่อสารออกมาเป็นคำพูดได้ ไม่สามารถบอกความรู้สึกกังวล เครียด ดีใจ หรือเสียใจได้เหมือนกับคนเรา แต่รู้หรือไม่ว่าสุนัขก็มีวิธีการสื่อสารและมีการแสดงออกของสุนัขทางด้านพฤติกรรมที่จะทำให้เรารู้ได้ว่าตอนนี้สุนัขของเรากำลังรู้สึกอย่างไร และกำลังสื่อสารอะไร การที่เราได้เรียนรู้พฤติกรรมของสุนัขจึงไม่ได้เป็นเพียงการรับรู้ถึงการสื่อสารที่สุนัขของเรากำลังบอกเราอยู่เท่านั้น แต่ยังเป็นการป้องกันปัญหาด้านพฤติกรรมที่อาจส่งผลรุนแรงขึ้นได้อีกด้วย
                                    มารู้จักสุนัขของเรากันให้มากขึ้น ด้วยการศึกษาพฤติกรรม ไม่ว่าจะเป็นการแสดงความรัก เล่น ความอึดอัด ความเครียด ความกลัว รวมทั้งการกินที่ผิดปกติต่างๆ เพราะพฤติกรรมและท่าทางต่างๆ ที่สุนัขแสดงออกมา ก็เพื่อให้เราเข้าใจ และเข้าสู่ก้าวแรกในการป้องกันปัญหาพฤติกรรมสุนัข
                                    รู้ไว้ก่อน ป้องกันได้ ดีกว่าไปแก้ไขปัญหาเรื่องพฤติกรรม ที่เจ้าของต่างก็ยืนยันเป็นเสียงเดียวกันว่าทำได้ยากกว่ากันเยอะเลยบ</p>
                                <b>
                                    <p align=left>พฤติกรรมแสดงความรักและการเล่น<br>
                                </b>
                                การแสดงออกของสุนัขที่บอกถึงความรักเจ้าของ หรือสื่อว่าอยากเล่นกับเจ้าของนั้นดูออกไม่ยากเลย มาดูกันว่าคุณเคยเห็นสุนัขแสดงพฤติกรรมเหล่านี้กับคุณหรือเปล่า ถ้าหากเคยเห็นอาจจะต้องอมยิ้มให้กับความน่ารัก หรือไม่ก็ต้องเตรียมตัวลุกจากโซฟา ไปใส่รองเท้าเสียหน่อย เพราะเรากำลังจะไปเบิร์นเดินออกกำลังกันแล้ว
                                นอนหงายพุง : ท่านี้บอกว่าสุนัขรักและไว้ใจคุณอย่างมาก และมีความผ่อนคลาย ไม่กังวล จึงยอมนอนหงายให้เกาพุงได้
                                ตาพริ้มหูลู่ กระดิกหาง : เป็นการแสดงออกของสุนัขที่บอกถึงความเป็นมิตร หากพบท่าทางแบบนี้แปลได้เลยง่ายๆ ว่าลูบหัวสุนัขได้เลยไม่เป็นอันตราย เพราะสุนัขกำลังบอกว่ารักและไว้ใจคุณ
                                ย่อตัวก้มคำนับ : สุนัขที่แสดงท่าทางคล้ายก้มต่ำคำนับมาทางคุณ หางชี้ขึ้น กระดิกไปมา เป็นสัญญาณที่บอกแล้วว่าสุนัขพร้อมเล่นกับคุณ และเล่นได้เดี๋ยวนี้เลย
                                มองอย่างมั่นใจ : จะเห็นสุนัขยืนมั่นคง หางชูแกว่งช้าๆ หน้าตาท่าทางผ่อนคลาย นั่นแหละสุนัขกำลังมอบความมั่นใจและไว้วางใจคุณอยู่
                                กระดิกหาง : สัญญาณเด่นของการชวนเล่น เช่น สุนัขกระดิกหาง ส่ายสะโพก สุนัขอาจเคลื่อนไหวรอบๆ สุนัขตัวอื่น เหล่านี้บ่งบอกว่าสุนัขกำลังตื่นเต้นและเป็นมิตร</p>
                                <b>
                                    <p align=left> พฤติกรรมแสดงความอึดอัด เครียด <br>
                                </b>
                                พฤติกรรมสำคัญที่เจ้าของสุนัขควรรู้ไว้อย่างหนึ่ง คือการแสดงของสุนัขว่ากำลังมีความอึดอัด ความเครียด ซึ่งความกังวลเหล่านี้ทำให้เกิดปัญหาด้านพฤติกรรมอื่นๆ ต่อมาอีกได้ หากไม่ได้รับการแก้ไขอย่างถูกวิธี ดังนั้นการเข้าใจพฤติกรรมของสุนัข จะช่วยให้เราสามารถปลอบโยนสุนัข และหาวิธีแก้ไขอย่างตรงจุดมากขึ้น
                                คำราม : เมื่อสุนัขส่งเสียงคำราม แสดงว่าสุนัขรู้สึกอึดอัด ถูกคุกคาม หรือเจ็บปวด จากการที่มีผู้บุกรุกหรือเข้ามาในอาณาเขตของสุนัข ซึ่งการส่งเสียงคำรามไม่ได้จัดเป็นความก้าวร้าวบริบทนี้ถือเป็นสัญญาณที่กำลังบอกว่าสุนัขรู้สึกอึดอัดมากกว่า
                                ส่งเสียงเห่า หรือหอน : สุนัขหลายๆ ตัวไม่สามารถควบคุมการหอนของตัวเองได้เมื่อรู้สึกเครียด นั่นเป็นการบอกเราว่าสุนัขเริ่มรู้สึกมีความกังวลเกิดขึ้น ในขณะที่การเห่าก็เป็นการบอกจากสุนัขว่ากำลังเครียดได้เช่นกัน แต่ก็ต้องดูปัจจัยอื่นร่วมด้วย เพราะการเห่าของสุนัขก็มีมาได้จากหลายสาเหตุ
                                เดินย่ำไปมา : แสดงถึงความตื่นเต้น เบื่อ ว้าวุ่นใจของสุนัข เป็นสัญญาณที่เจ้าของควรสังเกตเอาไว้เพราะเป็นตัวที่บอกว่าอะไรที่ทำให้สุนัขของคุณเกิดความกังวล
                                สุนัขกระดิกหางต่ำ : แสดงถึงความเสียใจ หากสุนัขกระดิกหางช้าๆ ลดต่ำลง จะบ่งบอกถึงความสับสน หรือกำลังสำรวจสิ่งแวดล้อมใหม่ๆ
                                หมอบหรือก้มราบไปบนพื้น : บ่งบอกถึงความกังวล การยอมแพ้ โดยจะมองไปยังบางสิ่งที่ทำสุนัขรู้สึกกลัว
                                ขนที่คอลุกชัน : จะเห็นสุนัขชันขนตั้งแต่แผงคอไปจนถึงส่วนหลัง เป็นกลไกในการป้องกันตัวเองจากศัตรู ตื่นตัวพร้อมรับเหตุการณ์ หากพบพฤติกรรมเช่นนี้ควรรีบออกห่าง เพราะสุนัขอาจกัดเราได้ </p>
                                <b>
                                    <p align=left> พฤติกรรมแสดงความกลัว <br>
                                </b>
                                มีพฤติกรรมหลากหลายแบบที่กำลังบอกว่าสุนัขของคุณรู้สึกกลัว โดยจะแสดงออกทางภาษากายต่างๆ หากเราสังเกตว่าสุนัขมีอาการกลัวแล้ว ควรหลีกเลี่ยงที่จะอยู่ใกล้สุนัขที่กำลังสื่อว่ามีอาการกลัวอยู่ เพราะคุณอาจถูกสุนัขกัดได้
                                หยุดนิ่ง : หากสุนัขของคุณเกิดอาการหยุดนิ่ง หรือมีอาการชะงัก เกิดจากความเครียดหรือกลัว เช่นเวลาที่สุนัขกำลังกินอาหาร หรือกำลังครอบครองของแทะเล่นชิ้นโปรด ซึ่งหากสุนัขรู้สึกกลัว หรือรู้สึกว่าไม่สามารถจัดการกับสถานการณ์นั้นได้แล้วล่ะก็ สุนัขก็อาจจะกัดเราได้
                                ลดหางลงเข้าไปอยู่ระหว่างขา : สัญญาณเด่นชัดที่บ่งบอกว่าสุนัขกำลังกลัว มีความกังวลใจ บางทีจะเห็นสุนัขลดหางลงไปอยู่ระหว่างขาและแกว่งหางไปด้วย ซึ่งอาจทำให้คนเข้าใจผิดว่าสุนัขกำลังมีความสุข
                                สุนัขเลียริมฝีปากและหอบ : หากสุนัขมีอาการหอบ และเลียริมฝีปากซ้ำไปซ้ำมา นั่นแสดงว่าสุนัขของคุณกำลังรู้สึกกลัว เช่น เวลาพาสุนัขไปพบคุณหมอ
                                หมอบต่ำ : ในลูกสุนัขที่รู้สึกกลัวบางครั้งจะสังเกตว่าสุนัขหมอบหรือย่อตัวต่ำ ส่วนในสุนัขโตจะเห็นว่าสุนัขจะดูลังเลที่จะวิ่งเข้ามาหาคุณ
                                แยกเขี้ยว : สุนัขที่กลัวอาจแยกเขี้ยวเพื่อขู่ให้ศัตรูไปให้ห่าง แม้การแยกเขี้ยวในบริบทอื่นอาจไม่ได้แสดงถึงความก้าวร้าวหรืออันตราย แต่หากสุนัขกำลังกลัว ก็ควรอยู่ให้ห่างไว้ เพื่อป้องกันอันตรายจากการถูกสุนัขกัด </p>
                                <b>
                                    <p align=left> พฤติกรรมการกิน <br>
                                </b>
                                พฤติกรรมที่มักทำให้เจ้าของสุนัขเป็นกังวลมากๆ ก็มักหนีไม่พ้นเรื่องพฤติกรรมการกินของสุนัข ไม่ว่าจะเป็นการกินที่มากเกินไป น้อยเกินไป กินของแปลกๆ กินแล้วก็อาเจียน ซึ่งปัญหาเหล่านี้มักบ่งบอกถึงปัญหาสุขภาพของสุนัข
                                กินมากกว่าปกติ : พฤติกรรมสุนัขที่กินมากกว่าปกติมีโอกาสเกิดภาวะอ้วน น้ำหนักเกิน ซึ่งนำไปสู่ปัญหาสุขภาพอื่นๆ ตามมา ไม่ว่าจะเป็นโรคกระดูกและข้อ โรคหัวใจ โรคตับ โรคไต เป็นต้น ซึ่งพฤติกรรมของสุนัขที่กินมากกว่าปกตินั้นอาจเป็นปัญหาที่มาจากการให้อาหารที่บ่อยเกินไปของเจ้าของได้ด้วย เจ้าของหลายๆ คนมักเข้าใจว่าทุกครั้งที่สุนัขมาขอกินอาหารนั้นหมายความว่าสุนัขกำลังหิว ซึ่งไม่เป็นความจริงเสมอไป ดังนั้นเจ้าของสุนัขก็ควรที่จะให้อาหารตามปริมาณและคำแนะนำที่ระบุไว้ในฉลากอาหาร นอกจากนี้การกินที่มากกว่าปกติ ยังเกิดได้จากปัญหาจากโรคที่เกี่ยวกับฮอร์โมน ที่มีผลให้สุนัขกินเยอะแต่การเผาผลาญทำงานต่ำลงกว่าปกติ
                                เบื่ออาหาร หรือกินน้อยกว่าปกติ : สุนัขที่ไม่ยอมกินอาหาร หรือแสดงอาการเบื่ออาหารนั้นจัดเป็นภาวะที่ไม่ปกติ และเป็นปัญหาที่สำคัญ เพราะอาการเบื่ออาหารนั้นเป็นสิ่งที่สะท้อนถึงความเจ็บป่วยต่างๆ ที่ส่งผลต่อพฤติกรรมของสุนัข ไม่ว่าจะเป็นโรคในระบบต่างๆ มีไข้ มีความเจ็บปวดเกิดกับร่างกาย หากคุณพบว่าสุนัขของคุณไม่กินอาหาร หรือส่งสัญญาณว่ามีปัญหาเกี่ยวกับการเบื่ออาหาร ควรรีบพาสุนัขไปพบสัตวแพทย์ เพื่อทำการตรวจร่างกายเพิ่มเติม และหาสาเหตุ นอกจากปัญหาการกินน้อยที่เกี่ยวข้องกับความเจ็บป่วยของร่างกายแล้ว สุนัขที่มีความเครียดหรือกังวลใจก็อาจกินน้อยกว่าปกติได้เช่นกัน เช่น ความเครียดจากการแยกจากกับเจ้าของ การขาดการออกกำลังกาย การเปลี่ยนอาหารแบบเฉียบพลัน เป็นต้น
                                กินอุจจาระ : สุนัขที่กินอุจจาระอาจได้รับอันตรายจากเชื้อโรคต่างๆ ที่อยู่ในอุจจาระ ไม่ว่าจะเป็นแบคทีเรีย โปรโตซัว พยาธิ หรือปรสิตต่างๆ ที่อยู่ในอุจจาระ ซึ่งพฤติกรรมการกินอุจจาระในสุนัขนั้นสามารถพบได้ โดยบางครั้งพบว่าเป็นสัญชาตญาณตามธรรมชาติในการกินอุจจาระเพื่อป้องกันลูกสุนัขจากผู้ล่า หรืออาจเป็นการสื่อข้อมูลระหว่างกันผ่านสารเคมีที่หลงเหลืออยู่ในอุจจาระ นอกจากนี้พบว่าในสุนัขที่ขาดสารอาหารอาจมีพฤติกรรมการกินอุจจาระเพื่อทำการดูดซึมสารอาหารที่ไม่ได้รับไปในการกินอาหารครั้งแรก หากพบว่าสุนัขของคุณมีพฤติกรรมการกินอุจจาระ ควรปรึกษาสัตวแพทย์ เพื่อหาสาเหตุและแก้ไขปัญหาอย่างถูกจุด
                                กินสิ่งแปลกปลอม : พฤติกรรมการกินสิ่งแปลกปลอมของสุนัข คือการกินสิ่งที่ไม่ใช่อาหาร ซึ่งอาจทำให้ติดคอ และเกิดปัญหาที่ระบบทางเดินอาหารตามมาได้ เช่น ปัญหาทางเดินอาหารอุดตัน ซึ่งเป็นอันตรายและอาจทำให้สุนัขถึงแก่ชีวิตได้ ซึ่งปัญหานี้มักเกิดจากความเครียด และความเครียดจากการแยกจากเจ้าของ ทำให้สุนัขเบื่อ หรืออ้างว้าง หรือเรียกร้องความสนใจจากเจ้าของ นอกจากนี้ควรมั่นใจว่าสุนัขได้รับสารอาหารที่มีคุณค่าเพียงพอต่อความต้องการของร่างกาย อย่างเช่น SUPERCOAT® (ซุปเปอร์โค้ท®) ที่เป็นสูตรอาหารสุนัขที่มีสารอาหารครบครัน มีคุณประโยชน์ที่สุนัขต้องการอย่างครบถ้วน
                                o ช่วยให้กล้ามเนื้อที่แข็งแรง อุดมไปด้วยโปรตีนคุณภาพสูงจากเนื้อวัวแท้ช่วยเสริมสร้างกล้ามเนื้อให้แข็งแรง
                                o สร้างเสริมระบบภูมิคุ้มกัน – ด้วยวิตามิน แร่ธาตุ และสารต้านอนุมูลอิสระที่จำเป็นต่อร่างกาย
                                o เพื่อผิวหนังและขนสวยเงางาม – ด้วยโอเมกา 3 และกรดไขมันโอเมกา 6
                                o ช่วยการทำงานของระบบย่อยอาหาร – ด้วยใยอาหารจากบีทรูทธรรมชาติ
                                o โดยปราศจากสีและวัตถุปรุงแต่งกลิ่นรสสังเคราะห์
                                สุนัขจึงมีสุขภาพที่ดีจากภายใน ช่วยลดปัญหาสุขภาพที่ทำให้เกิดพฤติกรรมการกินที่ผิดปกติต่างๆ เหล่านี้ได้ </p>
                                <b>
                                    <p align=left> ข้อสรุป (Conclusion) <br>
                                </b>
                                ปัญหาพฤติกรรมสุนัข เป็นปัญหาที่ป้องกันได้ หากเจ้าของสุนัขคอยสังเกตการแสดงออกของสุนัข ดังนั้นเจ้าของควรดูแลสุนัขทั้งทางร่างกายและจิตใจ โดยช่วยลดความเครียดให้สุนัขจากสิ่งแวดล้อมต่างๆ พาสุนัขไปออกกำลังกายเป็นประจำสม่ำเสมอ และเลือกอาหารสูตรที่เหมาะกับช่วงสุนัข เช่น SUPERCOAT® (ซุปเปอร์โค้ท®) สูตรสุนัขโต ที่มีสารอาหารครบถ้วนตามหลักโภชนาการ ช่วยเสริมสร้างสุขภาพที่ดีให้กับสุนัขได้อย่างเต็มที่ คัดสรรวัตถุดิบหลักจากธรรมชาติ หรือ SUPERCOAT® (ซุปเปอร์โค้ท®) สูตรลูกสุนัข ที่มีสารต้านอนุมูลอิสระ และ DHA ซึ่งจำเป็นต่อการเจริญเติบโตของสุนัข เพื่อให้สุนัขมีสุขภาพดีทั้งร่างกายและจิตใจเหมาะสมกับช่วงวัย ลดปัญหาพฤติกรรมที่อาจเกิดขึ้นได้กับสุนัขของคุณ </p>
                                <button class="btn btn-warning btn-xl text-uppercase" data-bs-dismiss="modal" type="button">
                                    <i class="fas fa-times me-1"></i>
                                    Close Project
                                </button>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- Portfolio item 4 modal popup-->
    <div class="portfolio-modal modal fade" id="portfolioModal4" tabindex="-1" role="dialog" aria-hidden="true">
        <div class="modal-dialog">
            <div class="modal-content">
                <div class="close-modal" data-bs-dismiss="modal"><img src="assets/img/close-icon.svg" alt="Close modal" /></div>
                <div class="container">
                    <div class="row justify-content-center">
                        <div class="col-lg-8">
                            <div class="modal-body">
                                <!-- Project details-->
                                <h2 class="text-uppercase">วิธีสังเกตพฤติกรรมแมว</h2>
                                <p class="item-intro text-muted"></p>
                                <img class="img-fluid d-block mx-auto" src="assets/img/portfolio/4.jpg" alt="..." />
                                <p>ร้อยทั้งร้อยของคนที่อยากเลี้ยงแมว ต้องเริ่มจากอาการติดอกติดใจในความน่ารักของน้องเหมียวกันทั้งนั้น แต่ช้าแต่…บรรดาทาสแมวทั้งหลาย อย่ามัวแต่สนใจความคิวต์ ความขี้อ้อนของเจ้าแมวน้อย จนลืมสังเกตพฤติกรรมของแมวตัวเองให้ดี ไม่ว่าคุณจะเป็นมือใหม่หัดเลี้ยงแมว หรือคนที่เลี้ยงแมวจนเป็นมือโปรแล้วก็ตาม เพราะพฤติกรรมแต่ละอย่างของแมวล้วนมความหมาย ดังนั้นทาสแมสทั้งหลายจงอ่าน จดจำและนำไปใช้ว่า เมื่อน้องเหมียวแสดงออกทางพฤติกรรมมันบ่งบอกอะไรได้บ้าง แบบไหนที่เรียก ‘น่าห่วง’ และแบบไหนเรียกว่า ‘น่ารัก’</p>
                                <p>พฤติกรรมนี้มีปัญหา…สุขภาพ</p>
                                <b>
                                    <p align=left>อาเจียนบอกโรค <br>
                                </b>
                                เชื่อว่าทาสแมวทุกคน ก่อนจะตัดสินใจรับเจ้าเหมียวมาเลี้ยงดู ย่อมรู้อยู่แล้วว่า พฤติกรรมอาเจียนก้อนขน เป็นเรื่องปกติที่สัตว์รักความสะอาดอย่างแมวนั้น จะต้องเลียขนตัวเองเป็นประจำ และกำจัดออกด้วยการขับถ่ายหรืออาเจียนก้อนขนออกมา
                                แต่เมื่อไหร่ก็ตามที่น้องเหมียวของคุณ อาเจียนบ่อย อาเจียนไม่หยุด อาเจียนฉับพลัน เมื่อนั้นคือสัญญาณของการติดเชื้อในระบบทางเดินอาหาร โดยสังเกตอาการไม่ยาก ถ้าหากอาเจียนเป็นสีเหลือง สันนิษฐานได้เลยว่าเป็นน้ำย่อย อาจเกิดจากการกินไม่เคี้ยว กินเร็ว กินไวเกินไป ถ้าอ้วกบ่อย 3 ครั้งขึ้นไปพาน้องไปหาหมอได้เลย ส่วนอาเจียนสีเขียวบ่งบอกว่าติดเชื้อรุนแรงในลำไส้หรือกระเพาะอาหาร อาเจียนสีแดงอันตรายมาก เพราะหมายถึงอวัยวะภายในฉีกขาด กระเพาะอาหารเป็นแผล อาเจียนเป็นฟองสีขาวที่มาพร้อมอาการไอค่อกแค่กแสดงว่าเป็นโรคเรื้อรัง สุดท้ายอาเจียนสีน้ำตาล เลือดออกในกระเพาะอาหารต้องรีบพาไปหาสัตวแพทย์ด่วนๆ!</p>
                                <b>
                                    <p align=left>ซึมเศร้าและเหงาหงอย <br>
                                </b>
                                หลังจากที่กอดรัดฟัดเหวี่ยง เล่นกันอย่างคึกคัก แต่จู่ๆ น้องเหมียวก็เปิดปุ่ม Ignore นิ่งเฉยใส่เราซะอย่างนั้น เรียกแล้วเรียกอีกก็ไม่ยอมมา เอาของโปรดมาล่อตาล่อใจก็ไม่ไหวติง ร่วมด้วยอาการซึมเศร้าผิดปกติ เดินลากขาหลัง หลบมุมไม่ยอมออกมาเล่น หรือแม้แต่พฤติกรรมที่ไม่เลียขนทำความสะอาดตัวเอง ล้วนเป็นสัญญาณบอกอาการว่าน้องกำลังไม่สบาย! ถ้าซึมนานอาการไม่ดีขึ้นสัก 2-3 วันก็เตรียมตัวพบสัตวแพทย์ได้เลยจ้า อาการแบบนี้ไม่ธรรมดาอย่ารอนาน เพราะอาจเป็นอาการเริ่มต้นของโรคตับได้</p>
                                <b>
                                    <p align=left>ขับถ่ายผิดวิสัย ไม่ปกติ <br>
                                </b>
                                ว่ากันต่อด้วยเรื่องของระบบขับถ่ายในร่างกายของแมว หากคุณสังเกตเห็นความผิดปกติ เช่น ท้องเสีย ฉี่เยอะ หรือแม้กระทั่งไม่ขับถ่ายอะไรเลยสักนิดแนะนำให้คุณสอดส่องกระบะทรายบ่อยๆ เพราะอย่างน้อยแมวต้องขับถ่ายวันละหนึ่งครั้งถ้าภายใน 24 ชั่วโมงนี้ แมวยังไม่มีท่าทีที่ดีขึ้น แถมมีอุจจาระสีดำ-แดงปนออกมาด้วย อาจเกิดจากกินสิ่งแปลกปลอม เช่น สายไฟ เศษผ้า เข้าไปจนทำให้ขับถ่ายผิดปกติ ต้องรีบพาไปให้สัตวแพทย์เช็คอาการ ส่วนน้องแมวตัวไหนที่ขับถ่ายนอกกระบะทราย
                                ทั้งๆ ที่คุณเองก็ทำความสะอาดกระบะทรายอย่างดี เก็บอึให้ทุกเช้าเย็น ปรับทุกอย่างให้น้องเหมียวทำธุระส่วนตัวได้สะดวกสุดๆ นั่นอาจเป็นสัญญาณบ่งบอกว่าแมวกำลังมีปัญหาเรื่องทางเดินปัสสาวะและโรคไขข้ออักเสบ</p>
                                <b>
                                    <p align=left>น้องเหมียวเคี้ยวหญ้า <br>
                                </b>
                                สำหรับพฤติกรรมการกินหญ้าของแมวนั้น บอกเลยว่าสบายใจหายห่วง เพราะแมวบางตัวก็อินและฟินไปกับการชมวิว แล้วชิลล์ไปกับการเล็มหญ้า หรือบางครั้งก็กินหญ้าเพื่อบรรเทาอาการต่างๆ ไม่ว่าจะกินหญ้าเพื่อช่วยในการสำรอกก้อนขนออกมา
                                เพื่อลดปัญหาขนอุดตันในระบบทางเดือนอาหาร กินหญ้าเพื่อเพิ่มกรดโฟลิก ช่วยผลิตฮีโมโกลบินในการลำเลียงออกซิเจน กินหญ้าเพื่อเป็นยาระบาย ช่วยรักษาสมดุลของระบบย่อยอาหารและขับถ่าย เพิ่มกากใยไม่ให้ท้องผูก ข้อควรระวังอย่างเดียวที่เจ้าของต้องจับตาดูให้ดี คือ ระวังอย่าให้น้องเหมียวกินหญ้ามากจนเกินไป เพราะเมื่อไหร่ที่แมวกินหญ้าตลอดเวลา กินทุกมื้อ กินหมดกระถาง กินทุกวัน เมื่อนั้น คือ ความผิดปกติ ต้องพาแมวไปหาสัตวแพทย์ด่วนๆ เลย</p>
                                <b>
                                    <p align=left>พฤติกรรมนี้เรียกร้องความสนใจ!</p>
                                </b>
                                <b>
                                    <p align=left>เหมียววววว ~ เสียงร้องนี้มีความหมาย <br>
                                </b>
                                มาทำความเข้าใจความหมายของเสียงร้องเรียก ‘เหมียว’ ที่บ่งบอกอารมณ์และความรู้สึกได้เป็นอย่างดี เมื่อไหร่ที่แมวของคุณร้องเหมียวด้วยโทนเสียงต่ำ นั่นหมายความว่าไม่แฮปปี้! แต่ถ้าร้องเหมียวขึ้นเสียงสูงแสดงว่าแฮปปี้ดี๊ด๊าสุดๆ ยิ่งถ้าร้องเหมียวซ้ำๆ คือการเรียกร้องความสนใจ อาจจะถึงเวลาอาหารของเขา หรืออาจจะอยากบอกอะไรกับคุณอยู่ก็ได้</p>
                                <b>
                                    <p align=left>นอนแผ่ หงายพุง <br>
                                </b>
                                ความน่ารักน่าเอ็นดูของน้องเหมียวยังไม่จบ ต้องมาตกเป็นทาสแมวกันต่อด้วยท่าออดอ้อนอย่างการนอนแผ่ หงายพุง ที่เป็นพฤติกรรมเรียกร้องว่า มาเล่นกันเถอะๆ ใครอยากเข้าไปคลอเคลียกับน้องเหมียวให้แฮปปี้ อย่าเมินท่านี้ รีบตามไปปรนนิบัติด่วนๆ</p>
                                <b>
                                    <p align=left>สะกิด นัวเนีย พันแข้งพันขา <br>
                                </b>
                                คนที่ชอบแมวขี้อ้อนจะต้องเลิฟพฤติกรรมนี้สุดๆ เพราะน้องเหมียวจะเรียกร้องความสนใจจากคุณตลอดเวลา เอาเท้ามาสะกิดบ้าง เดินวนเวียนพันแข้งขา นัวเนียตลอดเวลาไม่ห่างกาย แมวใครมีพฤติกรรมแบบนี้ก็อย่าลืมสละเวลา หันมาอุ้ม มาเล่นกับน้องสักนิดรับรองว่าน้องเหมียวแฮปปี้แน่นอน</p>
                                <b>
                                    <p align=left>พฤติกรรมแบบนี้แสดงว่ามีน้ำโห!</p>
                                </b>
                                <b>
                                    <p align=left>ว่าด้วยเรื่องของหาง <br>
                                </b>
                                วิธีสังเกตอารมณ์แมวง่ายๆ ให้ดูที่หาง… เห็นแมวเดินมาพร้อมหางยกตั้งขึ้นก็อุ่นใจได้ เพราะมันคือตัวบ่งบอกว่าอารมณ์ดี๊ดี แฮปปี้สุดๆ แต่ถ้าหางของเจ้าแมวเหน็บเอาไว้ระหว่างขา หรือเดินกระดิกหางไปมาแสดงว่าเริ่มรำคาญ และมีทีท่าว่าจะไม่อดทนอีกต่อไป! ยิ่งถ้าหางกระดิกไปมาซ้าย-ขวาอย่างรวดเร็ว อาการแบบนี้ไม่ดีแล้วจ้า เพราะน้องแมวกำลังขู่และกระวนกระวายใจสุดๆ แล้ว</p>
                                <b>
                                    <p align=left>ว่าด้วยเรื่องของหู <br>
                                </b>
                                มาต่อกันที่อีกหนึ่งวิธีสังเกตอารมณ์แมว คือ หู ถ้าหากหูตั้งหรือเอียงไปข้างหน้า แสดงว่ายังอารมณ์ดีมีความเป็นมิตรให้กันอยู่
                                แต่ถ้าหูลู่ตกลงมาแนบติดกับหัวเมื่อไหร่ก็เตรียมเผ่นกันให้ไว เพราะอาการแบบนี้อารมณ์ปะทุ ร่างกายต้องการปะทะ</p>
                                <b>
                                    <p align=left>ว่าด้วยเรื่องของการอึ <br>
                                </b>
                                อิทธิฤทธิ์อารมณ์โกรธ โมโหของน้องเหมียวไม่ใช่เรื่องเล่นๆ เลยสักนิด ใครอยากรู้ว่าจะแสบทรวงแค่ไหน ก็ลองทำอะไรสักอย่างให้น้องเหมียวไม่พอใจดูสิ แล้วจะรู้ว่ากระบะทรายระเบิดมันเป็นยังไง! เมื่อไหร่ที่เจออึของเจ้าพวกนี้ถ่ายทิ้งไว้ ไม่ยอมกลบ หรือขับถ่ายนอกกระบะทราย ผิดวิสัยรักสะอาดก็เตรียมตัวเตรียมใจง้อแมวได้เลยจ้า แต่ถ้าแมวของคุณเป็นตัวผู้แล้วฉี่ใส่หน้าบ้านก็ไม่ต้องแปลกใจ เพราะนี่คือบอกให้แมวตัวอื่นได้รู้ว่า นี่ถิ่นฉัน! พร้อมกับหาคู่ไปในตัว</p>
                                <b>
                                    <p align=left>พฤติกรรมนี้มีความรัก</p>
                                </b>
                                <b>
                                    <p align=left>คลอเคลียไม่ห่างกาย <br>
                                </b>
                                <p align=left>ได้เวลาใช้มนต์เสน่ห์ เสกให้ทาสจงเป็นทาสไปตลอดกาลและตลอดไป ด้วยพฤติกรรมสุดแบ๊วของน้องเหมียว ที่เอาตัวมาคลอเคลียพร้อมกับส่งเสียงร้องฟี้ดังๆ บ่งบอกว่ากำลังสบายใจ หรือจะเอาหน้ามาถูๆ ไถๆ เอาหัวชนกัน คือ กำลังทักทายและบอกถึงความสบายใจและชอบคุณ ยิ่งถ้ากระโดดขึ้นมาบนตัก แล้วเอาขาหน้านวดๆ ยิ่งหมายถึงว่ารักมากสุดใจไปเลย ยิ่งถ้าเมื่อไหร่ที่น้องเหมียวรู้สึกปลอดภัยเมื่อได้อยู่ใกล้เรา เผลอๆ มันจะมานอนทับเอาตัวมานอนซุกอยู่กับเจ้าของตลอดเวลาเลยล่ะ</p>
                                <b>
                                    <p align=left>งับเบาๆ แต่รักนี้ไม่เบานะ <br>
                                </b>
                                <p align=left>โดนแมวแง่ม งับนิ้ว ไม่ต้องตกใจ ชักมือหนี หรือตีน้องนะ! เพราะพฤติกรรมเหล่านี้ไม่มีเจตนาจะทำร้ายให้คุณเจ็บตัวหรืออย่างไร แต่ที่งับเบาๆ แบบนี้ น้องเหมียวกำลังบอกว่ารักมากนะ เจ้าทาส!</p>
                                <b>
                                    <p align=left>ของขวัญแทนใจ <br>
                                </b>
                                <p align=left>เมื่อไหร่ที่คุณได้ขยับสถานะเป็นคนพิเศษของน้องเหมียว เมื่อนั้นพวกเขาก็จะนำของขวัญแทนใจ ซึ่งแสดงออกถึงความภาคภูมิใจของสัญชาตญาณนักล่าไม่ว่าจะเป็นของเล่นชิ้นโปรดหรือ จิ้งจก นก หนูก็ตาม</p>
                                <button class="btn btn-warning btn-xl text-uppercase" data-bs-dismiss="modal" type="button">
                                    <i class="fas fa-times me-1"></i>
                                    Close Project
                                </button>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
    <!-- Bootstrap core JS-->
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/js/bootstrap.bundle.min.js"></script>
    <!-- Core theme JS-->
    <script src="js/scripts.js"></script>
    <!-- * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *-->
    <!-- * *                               SB Forms JS                               * *-->
    <!-- * * Activate your form at https://startbootstrap.com/solution/contact-forms * *-->
    <!-- * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *-->
    <script src="https://cdn.startbootstrap.com/sb-forms-latest.js"></script>
    <script> 
        
    </script>
</body>

</html>